app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
---
<div class="list-group">
  <% @recipe.ingredients.each do |ingredient| %>