app/controllers/login_session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "user1"]]
---
  def create
    puts params
    @user = User.find_by(username: params[:username])