app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipe_ingredients"."recipe_id" = "recipes"."id" INNER JOIN "recipe_ingredients" "recipe_ingredients_recipes_join" ON "recipe_ingredients_recipes_join"."recipe_id" = "recipes"."id" INNER JOIN "ingredients" ON "ingredients"."id" = "recipe_ingredients_recipes_join"."ingredient_id" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
---
  def show
    session[:return_to] = request.original_url
    @recipe = Recipe.joins(:recipe_ingredients, :ingredients).find(params[:id])
    recipe_count = RecipeVote.where(recipe_id: @recipe.id)[0]

SELECT  "recipes".* FROM "recipes" LIMIT 12 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "recipes" LIMIT 12 OFFSET 0) subquery_for_count
---
  def page
    session[:return_to] = request.original_url
    pageId = params['id'].to_i
    @recipes = Recipe.offset((pageId - 1) * $pageSize).limit($pageSize)

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (1, 2)
SELECT "recipes".* FROM "recipes"
---
  def search
    session[:return_to] = request.original_url
    @query = params['q']

    @user = valid_user
    @keywords = @query
                  .split(' ')
                  .reject { |c| c.empty? }
    @summary = "Search results for \"#{@query}\""
    @all = Recipe.includes(:ingredients).all