app/controllers/users_controller.rb

  def create
    @user = User.find_by(username: params[:user][:username])
    if @user
      puts "Duplicated username. Redirect to Signup"
      flash[:alert] = Array.new
      flash[:alert] << "Oops! This username has been used. Please try a different one. "
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "username"]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"